/*
	Name: 学生备忘录系统主文件(单链表)
	Copyright: ...
	Author: 周吉瑞 
	Date: ...
	Description: 学生备忘录系统 main.cpp
*/

#include "LinkList.h" 

int main(void)
{
	LinkList L;
	InitList_L(L);
	
	printf("------------------------------------------------------\n");
	printf("----------------------链表的祝福----------------------\n");
	printf("----------------------学生备忘录----------------------\n");
	printf("------------------------------------------------------\n");
	printf("\n尊敬的贾老师，教师节快乐鸭！！！\n");
	printf("一个备忘录小程序送给您作为礼物！！！\n");
	printf("感谢您一直的教诲！祝愿您万事如意！！！\n");
	printf("2020\\09\\10\n");
	printf("\n附：\n");
	printf("受限于自己的技术，该程序一但结束运行里面的记录便会清空,\n"); 
	printf("所以我把我的名字和学号初始化进去了，我永远都在！嘿哈…\n");
	printf("\n------------------------------------------------------\n");
	
	// 每次打开程序时默认初始化一个学生：20190521340 周吉瑞 
	ForeverStudent_ZhouJiRui(L);
	
	printf("------------------------------------------------------\n");
	PrintList_L(L);
	
	int r = 1;
	
	while (r) {
	
		int m;
		
		printf("\n------------------------------------------------------\n");
		printf("1.查找学生\n");
		printf("2.移出学生\n");
		printf("3.添加学生\n");
		printf("4.查询人数\n");
		printf("5.退出系统\n"); 
		printf("------------------------------------------------------\n");
		printf("请选择功能（输入序号）：");
		
		scanf("%d", &m);
	
		switch (m) {
		
			case 1:
				printf("------------------------------------------------------\n");
				printf("您选择了：查找学生\n");
				printf("\n请输入您所要查找学生的姓名：");
				
				char b[50];
				scanf("%s", &b); 
				LocateElem_L(L, b);
				
				break;
			
			case 2:
				printf("------------------------------------------------------\n");
				printf("您选择了：移出学生\n");
				printf("\n请输入您所要移出学生的姓名：");
				
				char c[50];
				scanf("%s", &c);
				GetElem_L(L, c);
			
				printf("------------------------------------------------------\n");
				PrintList_L(L); 
				
				break;
			
			case 3:
				printf("------------------------------------------------------\n");
				printf("您选择了：添加学生\n");
				printf("\n请输入您所要添加的学生位置序号（起始序号为1）：");
				
				int i;
				scanf("%d", &i);
				Student e;
				ScanfElem_L(e); 
				ListInsert_L(L, i, e); 
			
				printf("------------------------------------------------------\n");
				PrintList_L(L);
				
				break;
			
			case 4:
				printf("------------------------------------------------------\n");
				printf("您选择了：查询人数\n");
				
				int l;
				ListLength_L(L, l);
				printf("\n学生总人数为：%d人\n", l); 
				
				break;
			
			case 5:
				r = 0; 
				
				break;
				
			default :
				printf("\n输入错误，程序自动结束!\n");
				
				r = 0;
				
		}// switch
		
	}// while
	
	printf("------------------------------------------------------\n");
	printf("已退出系统！\n");
	printf("------------------------------------------------------\n");
	
	system("pause");
	return 0;	
} 
